{
  "classId": 3,
  "topic": "Linux File System Structure",
  "slides": [
    {
      "slideId": 1,
      "content": [
        {
          "type": "heading",
          "value": "Introduction to Linux File System Structure"
        },
        {
          "type": "text",
          "value": "Hello, and welcome to our class on Understanding the Linux Directory Hierarchy for Beginners! Let's start by getting familiar with some key components of the Linux file system structure."
        },
        {
          "type": "table",
          "value": [
            ["Directory", "Description"],
            ["/", "The root directory of the Linux file system."],
            ["bin", "Contains essential command-line utilities and binaries for users."],
            ["boot", "Holds files required to boot the operating system, such as kernel images, configuration files, and boot loaders."],
            ["dev", "Represents hardware devices in the system. Contains device nodes for communication between the kernel and hardware devices."],
            ["etc", "Stores system-wide configuration files that are used by various services and daemons."],
            ["home", "Contains users' home directories with their personal files, such as documents, music, and settings."],
            ["lib", "Contains essential libraries required by applications to run on the Linux system."],
            ["lost+found", "Recovers data from a damaged file system during disk checks or recovery procedures."],
            ["media", "Mount point for removable media devices, such as USB drives, CDs, and DVDs."],
            ["mnt", "Temporary mount point directory used to mount file systems temporarily."],
            ["opt", "Contains additional software packages not part of the default Linux distribution."],
            ["proc", "Virtual file system representing the kernel and system processes."],
            ["root", "An empty directory that is a symbolic link to /."],
            ["sbin", "Contains essential system binaries for administrators and superusers."],
            ["sys", "Stores device driver files, kernel modules, and system data."],
            ["tmp", "Temporary storage area used by applications and the operating system to store temporary files."],
            ["usr", "Contains user-related files and directories for non-essential applications, libraries, documentation, and local data."],
            ["var", "Stores variable data generated by applications during runtime, such as logs, caches, mail spool, and printer queue files."]
          ]
        },
        {
          "type": "image",
          "url": "https://fireship.io/courses/linux/img/linux-file-system.png",
          "alt": "Linux File System Structure"
        }
      ],
      "video": {
        "platform": "youtube",
        "url": "https://www.youtube.com/watch?v=42iQKuQodW4"
      }    
    },
    {
      "slideId": 2,
      "content": [
        {
          "type": "heading",
          "value": "Familiarizing Yourself with the Linux File System using the Command Line"
        },
        {
          "type": "text",
          "value": "Now that you understand the main components of the Linux file system structure, let's learn how to navigate it using the command line:"
        },
        {
          "type": "code",
          "command": "cd /",
          "description": "Navigate to the Root Directory: Type \"cd /\" to move to the root directory."
        },
        {
          "type": "code",
          "command": "cd ..",
          "description": "Go Back One Directory Level: Type \"cd ..\" or simply \"..\" to move up one level in the directory hierarchy."
        },
        {
          "type": "code",
          "command": "ls",
          "description": "List Files and Directories: Use the \"ls\" command followed by a directory name (optional) to list files and directories within that directory."
        },
        {
          "type": "code",
          "command": "cd Documents",
          "description": "Change Directories: Use the \"cd\" command followed by the directory name you want to move into."
        },
        {
          "type": "code",
          "command": "mkdir new_folder",
          "description": "Create New Directories: Use the \"mkdir\" command followed by the desired directory name."
        },
        {
          "type": "code",
          "command": "rmdir old_folder",
          "description": "Remove an Empty Directory: Use the \"rmdir\" command followed by the directory name you want to delete."
        },
        {
          "type": "code",
          "command": "rm -r non_empty_folder",
          "description": "Delete a Non-Empty Directory: To remove a non-empty directory, first navigate to it and use the \"rm -r\" command followed by the directory name (without the trailing slash). Be careful not to delete important files or directories accidentally!"
        },
        {
          "type": "code",
          "command": "cp document.txt /home/new_folder",
          "description": "Copy Files and Directories: Use the \"cp\" command followed by the source file/directory and destination file/directory."
        },
        {
          "type": "code",
          "command": "mv old_file.txt new_file.txt",
          "description": "Move (Rename) Files and Directories: Use the \"mv\" command followed by the source file/directory and destination file/directory."
        },
        {
          "type": "code",
          "command": "ln -s /home/old_folder /home/new_folder/old_folder_link",
          "description": "Linking Files and Directories: Create a symbolic link using the \"ln -s\" command followed by the source file/directory and destination link name. This creates a shortcut to the original folder in the new location."
        }
        ]
    },
    {
      "slideId": 3,
      "content": [
        {
          "type": "heading",
          "value": "Path"
        },
        {
          "type": "definition",
          "value": "A path is the location of a file or directory in the Linux file system.",
          "example": "Example: /home/user/file.txt"
        },
        {
          "type": "heading",
          "value": "Tips"
        },
        {
          "type": "list",
          "items": [
            "Keep your home directory organized by creating directories for different types of files (documents, pictures, music, etc.).",
            "Regularly backup important data to avoid data loss in case of system crashes or accidents.",
            "Update your system regularly to keep it secure and up-to-date."
          ]
        }
      ]
    }
  ]
}